Revit 2027 API
BuiltInFailures.RebarCouplerFailures.CouplerRequiredRemoveFromGroup Property
 The coupler is invalid in group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CouplerRequiredRemoveFromGroup { get; }
Public Shared ReadOnly Property CouplerRequiredRemoveFromGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CouplerRequiredRemoveFromGroup {
	FailureDefinitionId^ get ();
}
static member CouplerRequiredRemoveFromGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace